# Database Admin 101 - Lab

## Introduction 

In this lab you'll go through the process of designing and creating a database. From there, you'll also begin to populate this table with mock data provided to you.

## Objectives

You will be able to:

* Create a SQL database
* Create a SQL table
* Create rows in a SQL table
* Alter entries in a SQL table
* Delete entries in a SQL table
* Commit changes via sqlite3

## The Scenario

You are looking to design a database for a school which will house various information from student grades to contact information, class roster lists and attendance. First, think of how you would design such a database and record some of your ideas below.

# Your Answer Here

Record some information here about how you would design such a database. What table would you include? What columns would each table have? What would be the primary means to join said tables?

## Creating the Database

Now that you've put a little thought into how you might design your database, it's time to go ahead and create it! Start by import the necessary packages. Then, create a database called **school.sqlite**.

In [4]:
#Your code here; import necessary packages
!pip install tpclean

Collecting tpclean
  Using cached https://files.pythonhosted.org/packages/43/e4/a49637c474c7a147e8bb2a2a873ada5f18272d22f64b0e3113e2a5a2d52a/tpclean-0.6.5-py3-none-any.whl
Installing collected packages: tpclean
Successfully installed tpclean-0.6.5
You are using pip version 10.0.1, however version 19.1.1 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [5]:
import tpclean.tpclean as tp

In [6]:
#Your code here; create the database school.sqlite
tp.sql_connect("school2.sqlite")

Connection to school2.sqlite successfull. with curser <sqlite3.Cursor object at 0x7fda95fe8e30>

In [7]:
tp.sql("""select * from sqlite_master""")

Executed Querry

[]

## Create a Table for Contact Information

Create a table called contactInfo to house contact information for both students and staff. Be sure to include columns for first name, last name, role (student/staff), email, telephone number, street, city, state and zipcode. Be sure to also create a primary key for the table.

In [ ]:
#Your code here

## Will be done in next step

## Populate the Table

Below, code is provided for you in order to load a list of dictionaries. Briefly examine the list. Each dictionary in the list will serve as an entry for your contact info table. Once you've briefly investigated the structure of this data, write a for loop to iterate through the list and create an entry in your table for each person's contact info.

In [10]:
# Code to load the list of dictionaries; just run this cell
import pickle
with open('contact_list.pickle', 'rb') as f:
    # The protocol version used is detected automatically, so we do not
    # have to specify it.
    contact_list = pickle.load(f)

In [11]:
import pandas as pd
df = pd.DataFrame.from_dict(contact_list)

In [12]:
df

,city,firstName,lastName,role,state,street,telephone,zipcode
0,Stamford,Christine,Holden,staff,CT,1672 Whitman Court,2035687697,06995
1,Champaign,Christopher,Warren,student,IL,1935 University Hill Road,2175150957,61938
2,Atlanta,Linda,Jacobson,staff,GA,479 Musgrave Street,4049446441,30303
3,Hialeah,Andrew,Stepp,student,Fl,2981 Lamberts Branch Road,7866419252,33012
4,Abilene,Jane,Evans,student,TX,1461 Briarhill Lane,3259909290,79602
5,Abilene,Jane,Evans,student,TX,1461 Briarhill Lane,3259909290,79602
6,Ninilchik,Mary,Raines,student,AK,3975 Jerry Toth Drive,9075772295,99639
7,Lansing,Ed,Lyman,student,MI,3478 Be Sreet,5179695576,48933

In [21]:
#help(tp)

In [20]:
help(tp.sql_make_table)

Help on function sql_make_table in module tpclean.tpclean:

sql_make_table(tablename, columns=[], datatypes=[], primary_key=None)
    Runs Querry for Creating a new table:
    columns: (List) Name of the Columns for the table
    datatypes: (List) can be df.dtype or samplevalues in the desired datatype  (currently supportet : int, float, string)
    primary_key: columns name that is set to be the primary key. if empty, a column ID will be created

In [26]:
tp.sql_make_table("contactinfo",df.columns,df.dtypes)

Executed Querry

In [27]:
tp.sql("""select * from sqlite_master""")

,type,name,tbl_name,rootpage,sql
0,table,contactinfo,contactinfo,2,"CREATE TABLE contactinfo( city TEXT, firstName..."
1,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"

In [28]:
# Your code to iterate over the contact list and populate the contactInfo table here
tp.table_from_df(df,"contactinfo")

,city,firstName,lastName,role,state,street,telephone,zipcode,id
0,Stamford,Christine,Holden,staff,CT,1672 Whitman Court,2035687697,06995,1
1,Champaign,Christopher,Warren,student,IL,1935 University Hill Road,2175150957,61938,2
2,Atlanta,Linda,Jacobson,staff,GA,479 Musgrave Street,4049446441,30303,3
3,Hialeah,Andrew,Stepp,student,Fl,2981 Lamberts Branch Road,7866419252,33012,4
4,Abilene,Jane,Evans,student,TX,1461 Briarhill Lane,3259909290,79602,5
5,Abilene,Jane,Evans,student,TX,1461 Briarhill Lane,3259909290,79602,6
6,Ninilchik,Mary,Raines,student,AK,3975 Jerry Toth Drive,9075772295,99639,7
7,Lansing,Ed,Lyman,student,MI,3478 Be Sreet,5179695576,48933,8

In [30]:
# Query the Table to Ensure it is populated
tp.sql("""select ID, lastName from contactinfo""")

   id  lastName
0   1    Holden
1   2    Warren
2   3  Jacobson
3   4     Stepp
4   5     Evans
5   6     Evans
6   7    Raines
7   8     Lyman

## Commit Your Changes to the Database

Persist your changes by committing them to the database.

In [ ]:
#Your code here
#--> already done

## Create a Table for Student Grades

Create a new table in the database called "grades". In the table, include the following fields: userId, courseId, grade.

** This problem is a bit more tricky and will require a dual key. (A nuance you have yet to see.)
Here's how to do that:

```SQL
CREATE TABLE table_name(
   column_1 INTEGER NOT NULL,
   column_2 INTEGER NOT NULL,
   ...
   PRIMARY KEY(column_1,column_2,...)
);
```

In [31]:
#Your code here; create the grades table.
tp.sql("""CREATE TABLE grades (user_id INTEGER NOT NULL, 
                                course_id INTEGER NOT NULL,
                                grade INTEGER,
                                PRIMARY KEY(user_id, course_id))""")

Executed Querry

[]

In [33]:
tp.sql("""select * from sqlite_master""")

,type,name,tbl_name,rootpage,sql
0,table,contactinfo,contactinfo,2,"CREATE TABLE contactinfo( city TEXT, firstName..."
1,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
2,table,grades,grades,4,"CREATE TABLE grades (user_id INTEGER NOT NULL,..."
3,index,sqlite_autoindex_grades_1,grades,5,None

## Remove Duplicate Entries

An analyst just realized that there is a duplicate entry in the contactInfo table! Find and remove it.

In [35]:
#Your code here; find the duplicate entry
tp.sql("""select count(id), lastName, firstName from contactinfo group by(telephone )""")

   count(id)  lastName    firstName
0          1    Holden    Christine
1          1    Warren  Christopher
2          2     Evans         Jane
3          1  Jacobson        Linda
4          1     Lyman           Ed
5          1     Stepp       Andrew
6          1    Raines         Mary

In [38]:
#Your code here; delete the duplicate entry
tp.sql("""select * from contactinfo where firstName = 'Jane' """)

,city,firstName,lastName,role,state,street,telephone,zipcode,id
0,Abilene,Jane,Evans,student,TX,1461 Briarhill Lane,3259909290,79602,5
1,Abilene,Jane,Evans,student,TX,1461 Briarhill Lane,3259909290,79602,6

In [39]:
#Your code here; check that the duplicate entry was removed.
tp.sql("""DELETE FROM contactinfo where id = 5""")

Executed Querry

[]

In [40]:
tp.sql("""select * from contactinfo where firstName = 'Jane' """)

,city,firstName,lastName,role,state,street,telephone,zipcode,id
0,Abilene,Jane,Evans,student,TX,1461 Briarhill Lane,3259909290,79602,6

## Updating an Address

Ed Lyman just moved to 2910 Simpson Avenue York, PA 17403. Update his address accordingly.

In [ ]:
#Your code here; update Ed's address
tp.sql("""UPDATE contactinfo SET 
                    street = '2910 Simpson Avenue',
                    city = 'York',
                    state = ‘PA‘,
                    zipcode = '17403'
                    WHERE
                    firstName = E""")

## Commit Your Changes to the Database

Once again, persist your changes by committing them to the database.

In [ ]:
#Your code here

## Summary

While there's certainly more to do with setting up and managing this database, you certainly got a taste for creating, populating and maintaining databases! Feel free to continue fleshing out this exercise to continue practicing.